src/cfe/YAxUnit/AccumulationRegisters/ТоварныеЗапасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварныеЗапасы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/YAxUnit/CommonModules/ОМ_ДЗ_ОТУС/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("СозданиеДокументовПриходаТоваров")
   	.ДобавитьТест("СозданиеПриходТовара1", "", "Позитив")
   	.ДобавитьТест("СозданиеПриходТовара2", "", "Позитив")
   	.ДобавитьТест("СозданиеПриходТовара3", "", "Позитив")
   	.ДобавитьТест("СозданиеРасходТовара1", "", "Позитив")
   	.ДобавитьТест("СозданиеРасходТовара2", "", "Позитив")
   	.ДобавитьТест("СозданиеРасходТовара3", "", "Позитив")
	.ДобавитьТест("ПроверкаДвижений", "", "Позитив")
//	.УдалениеТестовыхДанных()
	;

КонецПроцедуры

Процедура СозданиеПриходТовара1() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Мосхлеб = Справочники.Контрагенты.НайтиПоКоду("000000012");  //Мосхлеб ОАО
	Хлеб = Справочники.Товары.НайтиПоКоду("000000029"); //Хлеб
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Поставщик", Мосхлеб) 
    	.Установить("Дата", ТекущаяДата())
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Хлеб) 
	        .Установить("Количество", 10)
	        .Установить("Цена", 50)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + ПриходТовара);

	// 2. Выполнение функции.
	РезультатФункции = ПриходТовара;
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.ПриходТовара")
		.Свойство("Поставщик").Равно(Мосхлеб)
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[0].Количество").Равно(10)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;	
		
КонецПроцедуры 

Процедура СозданиеПриходТовара2() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000011");  //ЭлектроБыт ЗАО
	Товар = Справочники.Товары.НайтиПоКоду("000000040"); //Sony К3456P
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Поставщик", Поставщик) 
    	.Установить("Дата", ТекущаяДата())
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Товар) 
	        .Установить("Количество", 10)
	        .Установить("Цена", 2000)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + ПриходТовара);
	
	// 2. Выполнение функции.
	РезультатФункции = ПриходТовара;
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.ПриходТовара")
		.Свойство("Поставщик").Заполнено()
		.Свойство("Склад").Заполнено()
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[0].Количество").Больше(0)
	  	.Свойство("Товары[0].Сумма").Больше(0)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;
		
	КонецПроцедуры

Процедура СозданиеПриходТовара3() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000010");  //Корнет ЗАО
	Товар = Справочники.Товары.НайтиПоКоду("000000005"); //Тапочки
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Поставщик", Поставщик) 
    	.Установить("Дата", ТекущаяДата())
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Товар) 
	        .Установить("Количество", 100)
			//.Установить("Цена", 200)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + ПриходТовара);

	// 2. Выполнение функции.
	РезультатФункции = ПриходТовара;
	ВыборкаДвижений = ЮТЗапросы.ДвиженияДокумента(ПриходТовара.Ссылка, "ТоварныеЗапасы");

	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.ПриходТовара")
		.Свойство("Поставщик").Заполнено()
		.Свойство("Склад").Заполнено()
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[-1].Количество").Больше(0)
	  	.Свойство("Товары[-1].Сумма").Больше(0)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;    
		
КонецПроцедуры

Процедура СозданиеРасходТовара1() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Мосхлеб = Справочники.Контрагенты.НайтиПоКоду("000000012");  //Мосхлеб ОАО
	Хлеб = Справочники.Товары.НайтиПоКоду("000000029"); //Хлеб
	
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Покупатель", Мосхлеб) 
    	.Установить("Дата", ТекущаяДата())
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Хлеб) 
	        .Установить("Количество", 10)
	        .Установить("Цена", 50)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + РасходТовара);
	
	// 2. Выполнение функции.
	РезультатФункции = РасходТовара;
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.РасходТовара")
		.Свойство("Покупатель").Равно(Мосхлеб)
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[0].Количество").Равно(10)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;
		
КонецПроцедуры 

Процедура СозданиеРасходТовара2() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000011");  //ЭлектроБыт ЗАО
	Товар = Справочники.Товары.НайтиПоКоду("000000040"); //Sony К3456P
	
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Покупатель", Поставщик) 
    	.Установить("Дата", ТекущаяДата())
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Товар) 
	        .Установить("Количество", 10)
	        .Установить("Цена", 2000)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + РасходТовара);
	
	// 2. Выполнение функции.
	РезультатФункции = РасходТовара;
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.РасходТовара")
		.Свойство("Покупатель").Заполнено()
		.Свойство("Склад").Заполнено()
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[0].Количество").Больше(0)
	  	.Свойство("Товары[0].Сумма").Больше(0)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;
		
	КонецПроцедуры

Процедура СозданиеРасходТовара3() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000010");  //Корнет ЗАО
	Товар = Справочники.Товары.НайтиПоКоду("000000005"); //Тапочки
	
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Покупатель", Поставщик) 
    	.Установить("Дата", ТекущаяДата())
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Товар) 
	        .Установить("Количество", 100)
			//.Установить("Цена", 200)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + РасходТовара);

	// 2. Выполнение функции.
	РезультатФункции = РасходТовара;
	ВыборкаДвижений = ЮТЗапросы.ДвиженияДокумента(РасходТовара.Ссылка, "ТоварныеЗапасы");

	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.РасходТовара")
		.Свойство("Покупатель").Заполнено()
		.Свойство("Склад").Заполнено()
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[-1].Количество").Больше(0)
	  	.Свойство("Товары[-1].Сумма").Больше(0)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;    
		
КонецПроцедуры

Процедура ПроверкаДвижений() Экспорт
	
	//Данные = Новый Массив;
	//Данные.Добавить(Новый Структура("КодТовара", "000000005")); // Тапочки
	//Данные.Добавить(Новый Структура("КодТовара", "000000029")); // Хлеб
	//Данные.Добавить(Новый Структура("КодТовара", "000000040")); // Sony К3456P

//	// Поиск всех объектов
//	Для Каждого Элемент Из Данные Цикл 
//		
//	    Товар = Справочники.Товары.НайтиПоКоду(Элемент.КодТовара);
//		
//		ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
//		ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы";
//		ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Сумма(Количество) КАК ИтоговаяСумма");
//		ОписаниеЗапроса.Условия.Добавить("Товар.Код В(&Товар) И НАЧАЛОПЕРИОДА(Период, ДЕНЬ) = &ТекущаяДата");
//		ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", Товар);
//		ОписаниеЗапроса.ЗначенияПараметров.Вставить("ТекущаяДата", НачалоДня(ТекущаяДата()));
//		Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
//		
//		Если Результат[0].ИтоговаяСумма = 0 Тогда
//			
//			Сообщить("Ноль");
//			
//		ИначеЕсли Результат[0].ИтоговаяСумма = null Тогда
//			
//			Сообщить("null");	
//		Иначе
//			
//			Сообщить(Результат[0].ИтоговаяСумма);
//			
//		КонецЕсли;
//		
//	КонецЦикла;
	
	Товары = Новый Массив;
	Товары.Добавить("000000005"); // Тапочки
	Товары.Добавить("000000029"); // Хлеб
	Товары.Добавить("000000040"); // Sony К3456P
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ТоварныеЗапасыОстатки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход)
	               |				ТОГДА -ТоварныеЗапасыОстатки.Количество
	               |			ИНАЧЕ ТоварныеЗапасыОстатки.Количество
	               |		КОНЕЦ) КАК Количество,
	               |	ТоварныеЗапасыОстатки.Товар КАК Товар
	               |ИЗ
	               |	РегистрНакопления.ТоварныеЗапасы КАК ТоварныеЗапасыОстатки
	               |ГДЕ
	               |	ТоварныеЗапасыОстатки.Товар.Код В(&Товары)
	               |	И НАЧАЛОПЕРИОДА(ТоварныеЗапасыОстатки.Период, ДЕНЬ) = &ТекущаяДата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварныеЗапасыОстатки.Товар";
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Результат = Запрос.Выполнить().Выгрузить();
	
	Итог = Истина;
	
	Для каждого СтрРезультата из Результат цикл
	
        Итог = СтрРезультата.Количество = 0;
		
		Если НЕ Итог Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	ЮТест.ОжидаетЧто(Итог).ЭтоИстина();
	
КОнецПроцедуры

#КонецОбласти
